
//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)
Console.WriteLine("Ввести число :");
      int num1 = Convert.ToInt32(Console.ReadLine ());
      if 
        (num1 % 2 == 0){
            Console.WriteLine("Число является четным");
      }
      else if (num1 % 2 != 0) {
        Console.WriteLine("Число не делится на 2");
      }

    

            

